In [1]:
# importing module
import sqlite3
import os

In [3]:
# current working Folder
scriptDir = os.path.dirname(os.path.realpath('__file__'))
# connecting to the database 
connection = sqlite3.connect(scriptDir + os.path.sep + "myTable.db")

In [4]:
# cursor 
crsr = connection.cursor()

In [19]:
sql = "Select * FROM Student "
ans = list(crsr.execute(sql)) 
for a in ans:
    print(a)

(1, 'Nishant', 'Ghanate', 22, 71, 'Byculla')
(2, 'Rinisha', 'Burriwar', 20, 13, 'Byculla')
(3, 'Vikas', 'Rajbhar', 21, 40, 'Byculla')
(4, 'Pankaj', 'Chaurasia', 21, 65, 'Chowpatty')
(5, 'Rishabh', 'Sutravey', 23, 70, 'Mumbai central')
(6, 'Sourabh', 'Sutravey', 20, 53, 'Mumbai central')
(7, 'Abhishek', 'Gupta', 21, 18, 'Chinchpokli')
(8, 'Shubham', 'Bonkar', 21, 47, 'Agripada')

In [12]:
sql = "Select DISTINCT Age FROM Student "
ans = list (crsr.execute(sql))
for a in ans:
    print(a)

(22,)
(20,)
(21,)
(23,)

In [13]:
sql = "Select COUNT(DISTINCT Age) FROM Student "
ans = crsr.execute(sql) 
print( list(ans) )

[(4,)]

In [18]:
sql = "Select * FROM Student WHERE Address = 'Byculla' "
ans = list(crsr.execute(sql))
for a in ans:
    print(a)

(1, 'Nishant', 'Ghanate', 22, 71, 'Byculla')
(2, 'Rinisha', 'Burriwar', 20, 13, 'Byculla')
(3, 'Vikas', 'Rajbhar', 21, 40, 'Byculla')

In [16]:
sql = "Select * FROM Student WHERE Address = 'Byculla' AND Age = 22"
ans = list(crsr.execute(sql))
print(ans)

[(1, 'Nishant', 'Ghanate', 22, 71, 'Byculla')]

In [17]:
sql = "Select * FROM Student WHERE NOT Address = 'Byculla' "
ans = list(crsr.execute(sql))
for a in ans:
    print(a)

(4, 'Pankaj', 'Chaurasia', 21, 65, 'Chowpatty')
(5, 'Rishabh', 'Sutravey', 23, 70, 'Mumbai central')
(6, 'Sourabh', 'Sutravey', 20, 53, 'Mumbai central')
(7, 'Abhishek', 'Gupta', 21, 18, 'Chinchpokli')
(8, 'Shubham', 'Bonkar', 21, 47, 'Agripada')

In [20]:
sql = "Select * FROM Student ORDER BY Age "
ans = list(crsr.execute(sql))
for a in ans:
    print(a)

(2, 'Rinisha', 'Burriwar', 20, 13, 'Byculla')
(6, 'Sourabh', 'Sutravey', 20, 53, 'Mumbai central')
(3, 'Vikas', 'Rajbhar', 21, 40, 'Byculla')
(4, 'Pankaj', 'Chaurasia', 21, 65, 'Chowpatty')
(7, 'Abhishek', 'Gupta', 21, 18, 'Chinchpokli')
(8, 'Shubham', 'Bonkar', 21, 47, 'Agripada')
(1, 'Nishant', 'Ghanate', 22, 71, 'Byculla')
(5, 'Rishabh', 'Sutravey', 23, 70, 'Mumbai central')

In [21]:
sql = "Select * FROM Student ORDER BY Age DESC "
ans = list(crsr.execute(sql))
for a in ans:
    print(a)

(5, 'Rishabh', 'Sutravey', 23, 70, 'Mumbai central')
(1, 'Nishant', 'Ghanate', 22, 71, 'Byculla')
(3, 'Vikas', 'Rajbhar', 21, 40, 'Byculla')
(4, 'Pankaj', 'Chaurasia', 21, 65, 'Chowpatty')
(7, 'Abhishek', 'Gupta', 21, 18, 'Chinchpokli')
(8, 'Shubham', 'Bonkar', 21, 47, 'Agripada')
(2, 'Rinisha', 'Burriwar', 20, 13, 'Byculla')
(6, 'Sourabh', 'Sutravey', 20, 53, 'Mumbai central')

In [22]:
sql_command = """INSERT INTO Student VALUES (NULL,"Alias", "Salias",21, 05,"Marine Lines");"""
crsr.execute(sql_command)

# To save the changes in the files. Never skip this. 
# If we skip this, nothing will be saved in the database.
connection.commit()

In [23]:
# execute the command to fetch all the data from the table emp
crsr.execute("SELECT * FROM Student") 
 
# store all the fetched data in the ans variable
ans = crsr.fetchall() 
 
# loop to print all the data
for i in ans:
    print(i)

(1, 'Nishant', 'Ghanate', 22, 71, 'Byculla')
(2, 'Rinisha', 'Burriwar', 20, 13, 'Byculla')
(3, 'Vikas', 'Rajbhar', 21, 40, 'Byculla')
(4, 'Pankaj', 'Chaurasia', 21, 65, 'Chowpatty')
(5, 'Rishabh', 'Sutravey', 23, 70, 'Mumbai central')
(6, 'Sourabh', 'Sutravey', 20, 53, 'Mumbai central')
(7, 'Abhishek', 'Gupta', 21, 18, 'Chinchpokli')
(8, 'Shubham', 'Bonkar', 21, 47, 'Agripada')
(9, 'Alias', 'Salias', 21, 5, 'Marine Lines')

In [26]:
sql = "Select *, MIN(Age) FROM Student  "
ans = list(crsr.execute(sql))
print(ans)

[(2, 'Rinisha', 'Burriwar', 20, 13, 'Byculla', 20)]

In [27]:
sql = "Select *, MAX(Age) FROM Student  "
ans = list(crsr.execute(sql))
print(ans)

[(5, 'Rishabh', 'Sutravey', 23, 70, 'Mumbai central', 23)]

In [29]:
sql = "Select AVG(Age) FROM Student  "
ans = list(crsr.execute(sql))
print(ans)

[(21.11111111111111,)]

In [31]:
sql = "Select SUM(ID) FROM Student  "
ans = list(crsr.execute(sql))
print(ans)

[(45,)]

In [32]:
# Where Starting From N 
sql = "Select * FROM Student WHERE FirstName LIKE 'N%' "
ans = list(crsr.execute(sql))
for a in ans:
    print(a)

(1, 'Nishant', 'Ghanate', 22, 71, 'Byculla')

In [34]:
# Where ending from t
sql = "Select * FROM Student WHERE FirstName LIKE '%t' "
ans = list(crsr.execute(sql))
for a in ans:
    print(a)

(1, 'Nishant', 'Ghanate', 22, 71, 'Byculla')

In [35]:
# Where substring contains isha 
sql = "Select * FROM Student WHERE FirstName LIKE '%isha%' "
ans = list(crsr.execute(sql))
for a in ans:
    print(a)

(1, 'Nishant', 'Ghanate', 22, 71, 'Byculla')
(2, 'Rinisha', 'Burriwar', 20, 13, 'Byculla')
(5, 'Rishabh', 'Sutravey', 23, 70, 'Mumbai central')

In [36]:
# Where second char contains i  
sql = "Select * FROM Student WHERE FirstName LIKE '_i%' "
ans = list(crsr.execute(sql))
for a in ans:
    print(a)

(1, 'Nishant', 'Ghanate', 22, 71, 'Byculla')
(2, 'Rinisha', 'Burriwar', 20, 13, 'Byculla')
(3, 'Vikas', 'Rajbhar', 21, 40, 'Byculla')
(5, 'Rishabh', 'Sutravey', 23, 70, 'Mumbai central')

In [37]:
# Where name start with N and atleast len = 3 
sql = "Select * FROM Student WHERE FirstName LIKE 'N_%_%' "
ans = list(crsr.execute(sql))
for a in ans:
    print(a)

(1, 'Nishant', 'Ghanate', 22, 71, 'Byculla')

In [40]:
# Where name start with R and end with B
sql = "Select * FROM Student WHERE FirstName LIKE 'R%A' "
ans = list(crsr.execute(sql))
for a in ans:
    print(a)

(2, 'Rinisha', 'Burriwar', 20, 13, 'Byculla')